### 데이터 병합
- concat , merge 
- 데이터 병합 진행
- concat 
- axis 축을 뜻함
- ignore_index 인덱스를 사용할 것인지, 혹은 새로운 인덱스를 사용할 것인지?

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6]})
df2 = pd.DataFrame({'A':[7,8], "B":[9,10]})
#데이터 프레임 형성

In [3]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
df2

   A   B
0  7   9
1  8  10

In [5]:
pd.concat([df1, df2],axis =0, ignore_index= True)
# axis= 0, 열을 중심으로 병합함 ↓
# ignore_index = True , 기존 인덱스를 무시함

   A   B
0  1   4
1  2   5
2  3   6
3  7   9
4  8  10

In [6]:
pd.concat([df1, df2],axis =0, ignore_index= False)
# ignore_index = False , 기존 인덱스를 유지, 어디서 병합되었는 지 구별 가능

   A   B
0  1   4
1  2   5
2  3   6
0  7   9
1  8  10

In [7]:
pd.concat([df1, df2],axis =1, ignore_index= False)
# axis = 1 , 행을 중심으로 병합 →
# df2는 2행을 가지고 있지 않음 = NaN

   A  B    A     B
0  1  4  7.0   9.0
1  2  5  8.0  10.0
2  3  6  NaN   NaN

## merge
- 두 개의 데이터 프레임을 조인(join)하는 함수 
- 공통된 컬럼을 기준으로 데이터프레임을 병합한다.

- left - 병합할 첫 번재 데이터프레임이고, 왼쪽 데이터프레임

- right - 병합할 두 번째 데이터프레임,. 오른쪽 데이터프레임

- on - 조인키로 사용할 컬럼 목록, 여기에 입력된 컬럼이 두 데이터프레임에 포함되어야 한다.

- left_on - 왼쪽 데이터프레임에서 조인 키로 사용할 컬럼 목록

- right_on - 오른쪽 동일

- left_index - 왼쪽 데이터프레임의 조인 기준으로 인덱스를 사용하지?

- right_index - 오른쪽 동일

- how - 조인 방법을 결정 기본값은 'inner'

## on

In [13]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6]})
df2 = pd.DataFrame({'A':[1,2,3], "C":[9,10,11]})
df3 = pd.DataFrame({'A':[1,2,4], "C":[12,13,14]})

In [10]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [11]:
df2

   A   C
0  1   9
1  2  10
2  3  11

In [12]:
pd.merge(df1,df2, on = 'A')
# A에 대해서 natural join 함

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [14]:
pd.merge(df1,df3, on = 'A')
# 역시 조인할 때 A가 같은 곳만 조인함 , 세번 째 행의 인자가 달라 버려짐

   A  B   C
0  1  4  12
1  2  5  13

## join 하고 싶은 컬럼이 2개 이상인 경우?

In [22]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'A':[1,2,4], "C":[9,10,11],'D':[500,600,700]})

In [16]:
df1

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [17]:
df2

   A   C    D
0  1   9  500
1  2  10  600
2  4  11  700

In [23]:
pd.merge(df1,df2, on = ['A','C']) #공통 컬럼을 지정하고 해당 컬럼의 값이 동일해야 한다!
# 컬럼 값 다르면 버려짐, 관계대수 selection 생각

   A  B   C    D
0  1  4   9  500
1  2  5  10  600

In [24]:
pd.merge(df1,df2, on = ['C','A']) # 순서는 크게 상관 없어 보임

   A  B   C    D
0  1  4   9  500
1  2  5  10  600

### left_on , right_on 인자
left_on - 왼쪽 데이터프레임에서 조인 키로 사용할 컬럼 목록

right_on - 오른쪽 동일

In [38]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'abc':[1,3,4], "C":[9,10,11],'D':[500,600,700]})

In [36]:
df1

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [33]:
df2

   abc  efg    D
0    1    9  500
1    3   10  600
2    4   11  700

In [34]:
df2.rename({'A':'abc'},axis=1, inplace=True)

In [35]:
df2

   abc  efg    D
0    1    9  500
1    3   10  600
2    4   11  700

In [39]:
pd.merge(df1,df2, left_on=['A'], right_on=['abc'])
# 왼쪽 조인 기준 컬럼 : left_on  = A
# 오른쪽 조인 기준 컬럼 : right_on  = abc
# 기준이 아니지만 컬럼명이 같은 C는 아래와 같이 표기

   A  B  C_x  abc  C_y    D
0  1  4    9    1    9  500
1  3  6   11    3   10  600

### 두 개 이상의 컬럼을 이용해서 병합을 해보자!

In [40]:
df2 = pd.DataFrame({'abc':[1,3,4], "efg":[9,10,11],'D':[500,600,700]})

In [42]:
display(df1)
display(df2)

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

   abc  efg    D
0    1    9  500
1    3   10  600
2    4   11  700

In [41]:
pd.merge(df1,df2, left_on=['A','C'],right_on=['abc','efg'])
 #left _on : (1,9), (2,10),(3,11)
 #right_on : (1,9),(3,10),(4,11)
 # 위 튜플 중 같은 것은 (1,9) 따라서 이 행만 출력 된다.

   A  B  C  abc  efg    D
0  1  4  9    1    9  500

### left_index, right_index 인자

In [63]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'abc':[1,3,4], "efg":[9,10,11],'D':[500,600,700]})

In [54]:
df1

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [45]:
df2

   abc  efg    D
0    1    9  500
1    3   10  600
2    4   11  700

In [61]:
df1.set_index('B', inplace=True)

In [62]:
df1

   A   C
B
4  1   9
5  2  10
6  3  11

In [64]:
df1.set_index('A', inplace=True)

In [65]:
df1 # set_index, 해당 열을 인덱스로 사용

   B   C
A
1  4   9
2  5  10
3  6  11

In [67]:
pd.merge(df1,df2,left_index = True, right_on ='abc')
# 왼쪽은 set_index로 설정한 A, 오른쪽 기준은 abc 열
# 왼쪽은 1,2,3  오른쪽은 1,3,4
# 같은 열은 1과 3 따라서 두 행만 출력됨

   B   C  abc  efg    D
0  4   9    1    9  500
1  6  11    3   10  600

### how
- how 조인 방법을 설정할 수 있음

- inner - 교집합의 개념

- left -왼쪽 데이터프레임 조인 키를 기준 병합

- right - 오른쪽 데이터 프레임 조인 키를 기준 병합

- outer - 왼쪽과 오른쪽 데이터프레임의 조인 키에 대한 합집합 기준 병합

In [68]:
df1 = pd.DataFrame({'A':[1,2,3], 'x':[1,2,3]})
df2 = pd.DataFrame({'A':[2,3,4], 'y':[2,3,4]})

In [69]:
display(df1)
display(df2)

   A  x
0  1  1
1  2  2
2  3  3

   A  y
0  2  2
1  3  3
2  4  4

In [70]:
#how 병합

pd.merge(df1, df2, on='A',how='inner') 
#교집합의 개념
# 조인의 키는 A

   A  x  y
0  2  2  2
1  3  3  3

In [72]:
#how 병합

pd.merge(df1, df2, on='A',how='left')
# 조인의 키는 A 
# left = 왼쪽 키를 기준으로 병합 , 오른쪽 (=df2)의 튜플은 (2,2) (3,3) (4,4)
# 이 중 왼쪽 A와 일치하는 튜플은 2와 3 이며 1은 존재하지 않아 NaN

   A  x    y
0  1  1  NaN
1  2  2  2.0
2  3  3  3.0

In [73]:
#how 병합

pd.merge(df1, df2, on='A',how='right') # 오른쪽 A 기준으로 조인

   A    x  y
0  2  2.0  2
1  3  3.0  3
2  4  NaN  4

In [74]:
#how 병합

pd.merge(df1, df2, on='A',how='outer') # 크로스 프로덕트

   A    x    y
0  1  1.0  NaN
1  2  2.0  2.0
2  3  3.0  3.0
3  4  NaN  4.0

In [75]:
df1 = pd.DataFrame({'A':[1,2,3], 'x':[1,2,3],'c':[10,20,30]})
df2 = pd.DataFrame({'A':[2,3,4], 'x':[2,7,4],'d':[100,200,300]})

In [76]:
df1

   A  x   c
0  1  1  10
1  2  2  20
2  3  3  30

In [77]:
df2

   A  x    d
0  2  2  100
1  3  7  200
2  4  4  300

In [78]:
pd.merge(df1, df2, on=['A','x'], how='inner') # 두 개의 컬럼을 기준으로 교집합 둘 중하나라도 다르면 탈락

   A  x   c    d
0  2  2  20  100